from openpyxl import Workbook
from openpyxl.styles import Alignment
import random

# Создание нового файла Excel
wb = Workbook()
# Активация активного листа
ws = wb.active

# Список фамилий
surnames = (
    'Смирнов А.И.', 'Иванов В.П.', 'Кузнецов Г.М.', 'Попов Д.С.', 'Васильев Е.А.', 'Петров Ж.И.', 'Соколов З.П.',
    'Михайлов И.Г.', 'Новиков К.Д.', 'Федоров Л.В.', 'Морозов М.Е.', 'Волков Н.Ж.', 'Алексеев О.З.', 'Лебедев П.Х.',
    'Семенов Р.Ц.', 'Егоров С.Ч.', 'Дмитриев Т.Ш.', 'Козлов У.Щ.', 'Николаев Ф.Ъ.', 'Соловьев Ы.Ы.', 'Борисов Э.Ь.',
    'Шмидт Ю.Э.', 'Козлов Я.Ю.', 'Павлов Я.Я.', 'Сидоров А.А.', 'Петров Б.Б.', 'Иванов В.В.', 'Смирнов Г.Г.',
    'Попов Д.Д.',
    'Васильев Е.Е.', 'Петров Ж.Ж.', 'Соколов З.З.', 'Михайлов И.И.', 'Новиков К.К.', 'Федоров Л.Л.', 'Морозов М.М.',
    'Волков Н.Н.', 'Алексеев О.О.', 'Лебедев П.П.', 'Семенов Р.Р.', 'Егоров С.С.', 'Дмитриев Т.Т.', 'Козлов У.У.',
    'Николаев Ф.Ф.', 'Соловьев Х.Х.', 'Борисов Ц.Ц.', 'Шмидт Ч.Ч.', 'Козлов Ш.Ш.', 'Павлов Щ.Щ.', 'Сидоров Ъ.Ъ.',
    'Петров Ы.Ы.', 'Иванов Ъ.Ъ.', 'Смирнов Ь.Ь.', 'Попов Э.Э.', 'Васильев Ю.Ю.', 'Петров Я.Я.', 'Соколов А.А.',
    'Михайлов Б.Б.', 'Новиков В.В.', 'Федоров Г.Г.', 'Морозов Д.Д.', 'Волков Е.Е.', 'Алексеев Ж.Ж.', 'Лебедев З.З.',
    'Семенов И.И.', 'Егоров К.К.', 'Дмитриев Л.Л.', 'Козлов М.М.', 'Николаев Н.Н.', 'Соловьев О.О.', 'Борисов П.П.',
    'Шмидт Р.Р.', 'Козлов С.С.', 'Павлов Т.Т.', 'Сидоров У.У.', 'Петров Ф.Ф.', 'Иванов Х.Х.', 'Смирнов Ц.Ц.',
    'Попов Ч.Ч.',
    'Васильев Ш.Ш.', 'Петров Щ.Щ.', 'Соколов Ъ.Ъ.', 'Михайлов Ы.Ы.', 'Новиков Ъ.Ъ.', 'Федоров Ь.Ь.', 'Морозов Э.Э.',
    'Волков Ю.Ю.', 'Алексеев Я.Я.', 'Лебедев А.А.', 'Семенов Б.Б.', 'Егоров В.В.', 'Дмитриев Г.Г.', 'Козлов Д.Д.',
    'Николаев Е.Е.', 'Соловьев Ж.Ж.', 'Борисов З.З.', 'Шмидт И.И.', 'Козлов К.К.', 'Павлов Л.Л.', 'Сидоров М.М.')

value31 = [i for i in range(1, 32)]
# Генерация списка с пустыми строками и 4мя Иксами
random_list = ['' for _ in range(27)]
mark_x = ['X'] * 4 + random_list

# Запись заголовка
ws.append(['ФИО', *value31])

# изменяем ширину колонки
ws.column_dimensions['A'].width = 20

# Запись списка фамилий и пометка каждого ряда
for surname in surnames:
    random.shuffle(mark_x)
    ws.append([surname, *mark_x])

# Пройти по каждой колонке и выровнять текст по центру для каждой ячейки
for col in ws.iter_cols(min_col=1, max_col=ws.max_column):
    for cell in col:
        cell.alignment = Alignment(horizontal='center', vertical='center')

# Сохранение файла
file_name = 'surnames_list.xlsx'
wb.save(file_name)
