# https://stepik.org/lesson/349845/step/1?unit=333700

def menu():
    """
    Меню для взаимодействия с пользователем.
    1. Начать игру
    2. Таблица счета за все игры
    3. Помощь
    4. Выход из игры
    :return:
    """
    pass

def decoration():
    """
    Полосочка для дикорации в консоле
    :return:
    """"
    pass


def score():
    """
    Считает очки, создает таблицу лидеров.
    :return:
    """
    pass



def is_valid():
    """
    Проаеряет введеное значение на валилность.
    Требования: Число от 1-1000 в зависимости от сложности
    :return:
    """"
    pass

def game():
    pass

def level():
    pass
